tutorials/pUelasticSolidFoam/squareBlock2D_fixed/constant/polyMesh/blockMeshDict
/*
 _____     _____     _____ _____ _____ _____    |  High-order Python FOAM
|  |  |___|  _  |_ _|   __|     |  _  |     |   |  Python Version: 3.10
|     | . |   __| | |   __|  |  |     | | | |   |  Code Version: 0.0
|__|__|___|__|  |_  |__|  |_____|__|__|_|_|_|   |  License: GPLv3
                |___|
*/
FoamFile
{
    version     2.;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// start of blockMeshDict

scale 1;

vertices
(
    (0 0 -0.5) //0
    (4 0 -0.5) //1
    (4 4 -0.5) //2
    (0 4 -0.5) //3
    (0 0 0.5) //4
    (4 0 0.5) //5
    (4 4 0.5) //6
    (0 4 0.5) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 4 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }


    top
    {
        type patch;
        faces
        (
            (7 3 2 6)
        );
    }

    right
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

    frontAndBackPlanes
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
