tutorials/pUelasticSolidFoam/squareBlock2D_fixed/constant/mechanicalProperties
/*
 _____     _____     _____ _____ _____ _____    |  High-order Python FOAM
|  |  |___|  _  |_ _|   __|     |  _  |     |   |  Python Version: 3.10
|     | . |   __| | |   __|  |  |     | | | |   |  Code Version: 0.0
|__|__|___|__|  |_  |__|  |_____|__|__|_|_|_|   |  License: GPLv3
                |___|
*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

mechanical
(
    steel
    {
        E               E [1 -1 -2 0 0 0 0] 10000;
        nu              nu [0 0 0 0 0 0 0] 0.0;
    }
);


// ************************************************************************* //
