tutorials/pUelasticSolidFoam/squareBlock2D_fixed/0/U
/*
 _____     _____     _____ _____ _____ _____    |  High-order Python FOAM
|  |  |___|  _  |_ _|   __|     |  _  |     |   |  Python Version: 3.10
|     | . |   __| | |   __|  |  |     | | | |   |  Code Version: 0.0
|__|__|___|__|  |_  |__|  |_____|__|__|_|_|_|   |  License: GPLv3
                |___|
*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type            fixedValue;
        value	        uniform (0 -1 0);
    }

    top
    {
        type            fixedValue;
        value	        uniform (0 1 0);
    }

    left
    {
        type            fixedValue;
        value	        uniform (-1 0 0);
    }

    right
    {
        type            fixedValue;
        value	        uniform (1 0 0);
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
