tutorials/pUelasticSolidFoam/squareBlock2D_fixed/0/pCorr
/*
 _____     _____     _____ _____ _____ _____    |  High-order Python FOAM
|  |  |___|  _  |_ _|   __|     |  _  |     |   |  Python Version: 3.10
|     | . |   __| | |   __|  |  |     | | | |   |  Code Version: 0.0
|__|__|___|__|  |_  |__|  |_____|__|__|_|_|_|   |  License: GPLv3
                |___|
*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type         	zeroGradient;
        value	        uniform 0;
    }

    top
    {
        type         	zeroGradient;
        value	        uniform 0;
    }

    left
    {
        type            zeroGradient;
        value	        uniform 0;
    }
    
    right
    {
        type            zeroGradient;
        value	        uniform 0;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
